Revit 2027 API
DirectContext3DHandleOverrides.Assign Method
 Assigns values of the source overrides to this object.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Assign(
	DirectContext3DHandleOverrides other
)
Public Sub Assign (
	other As DirectContext3DHandleOverrides
)
public:
void Assign(
	DirectContext3DHandleOverrides^ other
)
member Assign :
        other : DirectContext3DHandleOverrides -> unit
Parameters
other DirectContext3DHandleOverrides
 The source overrides.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectContext3DHandleOverrides Class
Autodesk.Revit.DB.DirectContext3D Namespace